_raw/linux-hpc-logstash.org
#+TITLE: Using Logstash to Collect Linux Software Logs from the HPC Cluster
#+AUTHOR: Andrew Caird
#+EMAIL: acaird@umich.edu
#+OPTIONS: ':t H:3 \n:nil ^:{} author:t toc:nil
#+CREATOR: Emacs 24.3.1 (Org mode 8.2.7b)
#+DESCRIPTION:
#+EXCLUDE_TAGS: noexport
#+KEYWORDS:
#+LANGUAGE: en
#+SELECT_TAGS: export

#+BEGIN_HTML
---
layout: page
title: Using Logstash to Collect Linux Software Logs from the HPC Cluster
---
#+END_HTML

#+BEGIN_HTML
<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

  ga('create', 'UA-55726337-1', 'auto');
  ga('send', 'pageview');

</script>
#+END_HTML

The Logstash Java program can run as a client or server; we run it as
a client on about 1500 computers in our high-performance computing
cluster, each one sending data via Redis to the Elasticsearch
servers.

* The CAEN Linux Logstash Client Configuration

** The Auditd Configuration

    The Linux configuration to capture the launches of executables is
   ~auditd~ with ~/etc/audit/audit.rules~ containing
   lines similar to these:
   #+BEGIN_SRC
     -a always,exit -F dir=/usr/cac/  -F perm=x -k usrcac
     -a always,exit -F dir=/usr/caen/ -F perm=x -k usrcaen
   #+END_SRC

   The ~-k WORD~ option adds a keyword to the logged data, and since
   we are asking ~auditd~ to watch particular directories (~/usr/caen~
   and ~/usr/cac~ in this example) the tags allow us to ask
   Elasticsearch to report on that field.

** The Logstash Configuration

   The Logstash configuration contains lines similar to these:
   #+BEGIN_SRC
   input {
       file {
           path => [ "/var/log/audit/audit.log" ]
           type => fluxsoftware
       }
   }
   #+END_SRC

* Local Dictionary 						   :noexport:
#  LocalWords:  Elasticsearch Logstash username Lucene Kibana Redis
#  LocalWords:  analytics DSL API Auditd
