linux-hpc-logstash.html
---
layout: page
title: Using Logstash to Collect Linux Software Logs from the HPC Cluster
---

<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

  ga('create', 'UA-55726337-1', 'auto');
  ga('send', 'pageview');

</script>

<p>
The Logstash Java program can run as a client or server; we run it as
a client on about 1500 computers in our high-performance computing
cluster, each one sending data via Redis to the Elasticsearch
servers.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">The CAEN Linux Logstash Client Configuration</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">The Auditd Configuration</h3>
<div class="outline-text-3" id="text-1-1">
<p>
 The Linux configuration to capture the launches of executables is
<code>auditd</code> with <code>/etc/audit/audit.rules</code> containing
lines similar to these:
</p>
<pre class="example">
-a always,exit -F dir=/usr/cac/  -F perm=x -k usrcac
-a always,exit -F dir=/usr/caen/ -F perm=x -k usrcaen
</pre>

<p>
The <code>-k WORD</code> option adds a keyword to the logged data, and since
we are asking <code>auditd</code> to watch particular directories (<code>/usr/caen</code>
and <code>/usr/cac</code> in this example) the tags allow us to ask
Elasticsearch to report on that field.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">The Logstash Configuration</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The Logstash configuration contains lines similar to these:
</p>
<pre class="example">
input {
    file {
        path =&gt; [ "/var/log/audit/audit.log" ]
        type =&gt; fluxsoftware
    }
}
</pre>
</div>
</div>
</div>
